import numpy as np
a = np.array([[2.3, 5.1, 4.7],
              [3.5, 6.7, 1.5],
              [8.4, 3.1, 9.2]])
b = np.array([[4.3, 8.1, 6.1],
              [3.7, 6.2, 1.5],
              [2.4, 5.7, 4.7]])
cols = len(a[0])
rows = len(a)   
cols_2 = len(b[0])
rows_2 = len(b)
print('Массив а содержит ', cols, 'столбцов и ', rows, 'строк')
print('Массив b содержит ', cols_2, 'столбцов и ', rows_2, 'строк')
print('Сумма элементов массивов', a+b)
print('Разность элементов массивов' , a-b)
print('Произведение элементов массивов', a*b)
print('Разность элементов массивов' , a/b)
A = np.square(a)
B = b%2
print('Возведение в квадрат элементов а:', A)
print('Остаток от деления b на 2:', B)
S = np.cos(a)+np.sin(b)
print('Сумма косинусов a и b', S)